[
    {
        "title": "Collage Art Therapy Bot",
        "major": "COEN",
        "year": "2022",
        "advisor": "Maya Ackerman",
        "abstract": "Our Collage Art Therapy Bot is an application that utilizes collage therapy to help users navigate their feelings and give them a better understanding of themselves. Unlike other forms of art therapy, collage therapy is much more inclusive and does not require any artistics skill that may intimidate users from participating. The user interface is split into three sections: the photo library, the chat bot, and the photo collage. The user can scroll through the library and pick the photos that they feel connected to. Then, the chatbot prompts the user to tell it what made them choose the photo. The Collage Art Therapy Bot is designed to be a supplemental tool to the user’s mental health resources and give them more perspective on their internal turmoil. The application brings the benefits of collage therapy in an easy-to-use and accessible format that is available for users whenever they need.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1221&context=cseng_senior"
    },
    {
        "title": "AMBER: AI Music Based Emotion Regulation",
        "major": "COEN",
        "year": "2022",
        "advisor": "Maya Ackerman",
        "abstract": "Music recommendations from apps are traditionally based on attributes like popularity or trendiness. While this method of recommending music may work for finding music in general, it does not address the granularity with which human emotions can change day to day, or even hour to hour. AMBER provides an accessible way to discover and listen to new music that matches one’s emotions in real time using the Spotify music platform and AI. Preliminary test results indicate that users found the music AMBER recommended to be more in line with the emotions they were feeling or wanted to feel. Future developments of AMBER could explore possible improvements on the recommendations it provides by integrating lyrics into the recommendation algorithm, as well as by increasing the amount of user input used in generating recommendations.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1216&context=cseng_senior"
    },
    {
        "title": "Santé le Match",
        "major": "COEN",
        "year": "2022",
        "advisor": "Silvia Figueira",
        "abstract": "In Senegal, many children are unaware of the importance of common hygiene practices due to limited health education on sanitation and personal hygiene. As a result, the repercussions of not following these practices are not clearly understood. This is an issue because some of the most common diseases in Senegal can be prevented through better sanitation practices and other basic preventative measures. Developing hygienic habits at a young age is critical—especially in a developing country such as Senegal. We have created a mobile application that educates and empowers children with the basic knowledge of WASH—water, sanitation, hygiene. Because Senegal often does not have reliable internet connectivity, our application will not rely on connectivity to function. Instead, users will only need to have the application installed on their technological device ahead of time in order to acquire full functionality of the application.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1237&context=cseng_senior"
    },
    {
        "title": "VelaChain: A Decentralized Exchange Built for Cross-Chain Communication",
        "major": "COEN",
        "year": "2022",
        "advisor": "Yuhong Liu",
        "abstract": "The blockchain industry is one of the fastest growing industries in the world right now. Billions of dollars of venture capital money is being put to work to innovate in this new space. One of the problems that has plagued the blockchain space since its inception is the lack of interoperability between blockchains. A single blockchain is great at dictating its own state but they rarely contain functionality to communicate with other blockchains. Furthermore, users on these blockchains have limited ways to swap cryptocurrencies from one blockchain to another. For this project, we built a cryptocurrency decentralized exchange built on top of the Cosmos software development kit to include cross-chain communication. We successfully implemented the basic functionality needed for a decentralized exchange to serve both sides of the market: users and liquidity providers.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1241&context=cseng_senior"
    },
    {
        "title": "Operating Machine Learning to Identify Tools (OMLIT)",
        "major": "COEN",
        "year": "2022",
        "advisor": "Sharon Hsiao",
        "abstract": "Today’s society is heavily reliant on using data to improve systems and create innovative technology. This project takes advantage of artificial intelligence, specifically machine learning (ML) which has allowed us to create a web application that detects tools, specifically hand tools. By having the user upload an image of one of three hand tools (screw driver, handsaw, or power drill) the user will be able to identify the tool as well as be provided information on hand tool safety. This identification system is handled by a pre-trained Convolutional Neural Network (CNN) model and trained using a self built data set. The tools that were used to build these models utilized python APIs TensorFlow and Keras while the data was scraped using defined python scripts. By providing the user an ease of use web application, it allows them to avoid tiresome searches online for proper tool handling. This gives them one centralized location in which the user could get their information from.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1235&context=cseng_senior"
    },
    {
        "title": "MARTHA: Offline Streaming Media for Cameroonian Refugees",
        "major": "COEN",
        "year": "2021",
        "advisor": "Silvia Figueira",
        "abstract": "MARTHA is a mobile application intended to deliver educational content to refugees from Cameroon currently residing in Nigeria. Refugees were forced to flee after advocating for educational freedom, so education is of utmost importance to those residing in these refugee camps. Parents want their children to benefit from learning general educational content, as well as vocational content which is important for social mobility. Our application will display files that can be followed at the users’ pace. While the project entails two phases, the final goal is to have a Raspberry Pi act as a server and local database, allowing local Android tablets to stream content from its own ad hoc wireless network. Our system will be able to provide equity in terms of social and economic advancement to those who need it the most.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1201&context=cseng_senior"
    },
    {
        "title": "StickARs: Effortlessly Apply a Fun Overlay to the Real World",
        "major": "COEN",
        "year": "2021",
        "advisor": "Ahmed Amer",
        "abstract": "Augmented Reality (AR) technology has slowly seeped into the mainstream as many mobile phone manufacturers increasingly develop hardware and software that enable AR applications. While the technology has been available for the past few years, there are not many compelling AR applications available on mobile phones. Additionally, shared AR experiences are difficult to produce and share. In order to create a compelling AR application, we created StickARs, an iOS application that makes it easy to create and share AR experiences , by placing virtual stickers anywhere in the world. StickARs allows users to choose from a predefined set of sticker templates, add text to stickers, and place them share them with the public, or with specific friends. Users can opt to add tags to their stickers, and subscribe to tags to see stickers that interest them. The greatest obstacle we faced was our ability to create a world-scale shared experience. We split the entire world into equal sized chunks called worldmaps that users instantiate the first time they place a sticker at that location. This allows users to only download the worldmaps they actually visit. However due to geolocation and AR limitations, the transition between worldmaps is not quite as smooth as we had originally hoped. We hope that in the future, Apple will extend the functionality of their AR Application Programming Interface to allow larger-scale experiences, which will allow us to create a smoother shared AR experience.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1211&context=cseng_senior"
    },
    {
        "title": "Enhanced Sensing Methods for UAV-Based Disaster Recovery",
        "major": "COEN",
        "year": "2021",
        "advisor": "Behnam Dezfouli",
        "abstract": "Natural and human-caused disasters devastate and displace civilian populations. Over the past century, the rate at which these catastrophes occur has increased dramatically. Climate change and unsustainable human behaviors are large contributors to the occurrence of natural disasters, therefore it is likely this upward trend will continue. The region of the world where a disaster takes place often determines how severe the implications are for the affected civilians. The devastation that occurs from a disaster is much greater in low-resourced regions of the world. Unmanned aerial vehicles (UAVs) are commonly used to assist first responders during disaster response. The existing UAV technologies focused on disaster recovery have proven to be quite effective, however, they are cost prohibitive, therefore limiting their use in developing regions of the world. Unlike the existing UAV-based disaster response technology, we propose a solution that enables indigenous first responders to reap the benefits of UAV-based disaster response technology. Through extensive evaluation of cutting-edge single-board computers, UAV hardware, and computer vision models, we have created a UAV system that has comparable flight time and flight capabilities as the existing industry standard solutions. Additionally, our system capitalizes on the functional drawbacks of the current solutions. It is more modular, allowing for a single UAV to be used in a variety of disasters, and it boasts the capability of real-time computer vision. Most importantly, our system can be recreated for one-eighth the cost of a consumer alternative with similar functionality. As a result, first responders in low-resourced regions have access to affordable disaster response technology that can be used to save lives.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1193&context=cseng_senior"
    },
    {
        "title": "Is Social Diversity Related to Misinformation Resistance? An Empirical Study on Social Communities",
        "major": "COEN",
        "year": "2021",
        "advisor": "Yuhong Liu",
        "abstract": "Misinformation has become a pervasive issue on online social media. Whether it is spread purposefully with ill intent or accidentally through ignorance, misinformation can be dangerous and create confusion in those who are affected by it. The investigation presented in this paper found that no research has been performed that directly examine the correlation between a social community’s misinformation resistance and diversity. This project utilizes CrowdTangle, a tool to gather data from Facebook groups, along with machine learning models to determine if this correlation can be drawn. We were able to find correlations between some diversity metrics with misinformation resistance and discuss potential rationales for such correlations.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1198&context=cseng_senior"
    },
    {
        "title": "Neptune: Marine Robot ROV Control System",
        "major": "COEN",
        "year": "2020",
        "advisor": "Christopher Kitts",
        "abstract": "The mysteries of the aquatic world and the dangers human activity poses to its environmental health are important considerations. It is pivotal we find ecient methods to study and monitor the subsea environments in order to maintain and improve their health. This document provides insight into the planning, design, implementation, and testing in developing an enhanced control system for a marine remotely operated vehicle (ROV) to eectively control various mounted hardware components. Our goal for this design is to greatly assist scientists and environmentalists observe and collect subsea data to improve the subsea environment.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1173&context=cseng_senior"
    },
    {
        "title": "YouLearn: Offline Media Streaming Application for Rural Uganda",
        "major": "COEN",
        "year": "2020",
        "advisor": "Silvia Figueira",
        "abstract": "The country of Uganda has implemented universal primary and secondary education. But still, some families cannot afford to send their children to school. When young people drop out of school, they often must resort to working illegal, unsafe, and low-paying jobs. Job prospects are even worse for disabled children. The objective of this project is to bring digital educational resources into rural villages in a low-cost manner. YouLearn is an educational system that allows for o✏ine media streaming. Our system includes a Raspberry Pi to store the media locally and allows for streaming without WiFi being necessary. Our system supports those most in need by bringing them the health and educational resources to help their families and communities thrive.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1185&context=cseng_senior"
    },
    {
        "title": "CentriFi: A CentralizedWireless Access Point Management Platform",
        "major": "COEN",
        "year": "2020",
        "advisor": "Behnam Dezfouli",
        "abstract": "With the ubiquity of wireless end-devices, more strain is placed on standard network deployment architectures. Mesh networks have started to rise in popularity in order to meet the needs of modern wireless networks. However, the existent solutions for deploying and centrally configuring mesh networks leave much to be desired, as most are either too expensive or too cumbersome. This paper showcases a solution to this problem, CentriFi—an open source platform, built to run on OpenWrt access points, providing a quick and easy way to set up and configure mesh networks in a central location using the 802.11s standard. CentriFi provides a web-based front-end for configuring the most crucial settings. Further, the system allows for greater expandability by providing a platform in which other configuration feature can be added by the open-source community in the future.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1161&context=cseng_senior"
    },
    {
        "title": "Lactic Acid Threshold Stimulator",
        "major": [
            "COEN",
            "MECH"],
        "year": "2019",
        "advisor": [
            "Ahmed Amer",
            "Sarah Kate Wilson"],
        "abstract": "As a person works out, the threshold of lactic acid will build causing anywhere from discomfort to pain. Reducing the discomfort caused by lactic acid could greatly improve an individual’s performance while working out. Reducing this discomfort may be done through Electrical Muscle Stimulation (EMS), which is the procedure of contracting muscles through sending electrical signals. Our team’s goal is to create LATS, a wearable and mobile application that alleviates discomfort and aids muscle recovery during the intense parts of a workout. The system consists of a heart rate monitor to measure lactic acid levels, a garment that is worn on the leg to stimulate muscles using EMS, and an app that allows the user to monitor their data. The user will control the hardware components through the app on their mobile device while exercising. Over time, our goal is that through the use of LATS, the user will be able to work through the muscle discomfort and push on to meet any workout goal that they set. While we were not able to carry out our test plan to reach any conclusive results, we hope to one day have approval from the Institutional Review Board to see just how effective our planned solution really is.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1053&context=idp_senior"
    },
    {
        "title": "Agora Teaching App",
        "major": "COEN",
        "year": "2019",
        "advisor": "Silvia Figueira",
        "abstract": "Professional development of teachers normally ends after formal collegiate education. Agora desires to help educators continually train, to learn the skills of good teaching in classrooms by using various, non-traditional methodologies. By translating Agoras current platform to an app, Agora can widen their scope and serve Latin American countries outside of Peru, where they are currently based. We will simply take their current business and course platform and provide a mobile user interface for it. By expanding the reach of Agora, Latin American teachers will be well equipped to teach their classes with innovation and effectiveness.",
        "url": "https://scholarcommons.scu.edu/cgi/viewcontent.cgi?article=1130&context=cseng_senior"
    }
]